<template><div><h1 id="osi参考模型" tabindex="-1"><a class="header-anchor" href="#osi参考模型" aria-hidden="true">#</a> <center>OSI参考模型</center></h1>
<h2 id="含义" tabindex="-1"><a class="header-anchor" href="#含义" aria-hidden="true">#</a> 含义</h2>
<h3 id="背景" tabindex="-1"><a class="header-anchor" href="#背景" aria-hidden="true">#</a> 背景</h3>
<p>第一个网络体系结构，即系统网络体系结构（SNA，System Network Architecture）于1974年，由IBM公司提出，此后，许多公司纷纷提出各自的网络体系结构。这些网络体系结构虽然都是采用了分层技术，但是层次的划分、功能分配与采用的技术均不同。随着信息技术的飞速发展，各种计算机的联网和各种计算机网络的互联成为迫切需要解决的问题。OSI模型正式在这样的背景下提出的。</p>
<h3 id="百科定义" tabindex="-1"><a class="header-anchor" href="#百科定义" aria-hidden="true">#</a> 百科定义</h3>
<p>OSI（Open System Interconnect），即开放式系统互联。 一般都叫OSI参考模型，是ISO组织在1985年研究的网络互联模型。该体系结构标准定义了网络互联的七层框架（物理层、数据链路层、网络层、传输层、会话层、表示层和应用层），即OSI开放系统互连参考模型。</p>
<h3 id="简介" tabindex="-1"><a class="header-anchor" href="#简介" aria-hidden="true">#</a> 简介</h3>
<p>为了更好地促进互联网络的研究和发展，国际标准化组织ISO制定了网络互连的七层框架的一个参考模型，称为开放系统互连参考模型，简称OSI/RM(Open System Internetwork Reference Model)。 [2]  OSI参考模型是一个具有7层协议结构的开放系统互连模型，是由国际标准化组织在20世纪80年代早期制定的一套普遍适用的规范集合，使全球范围的计算机可进行开放式通信。</p>
<p><img src="https://gaoqisen.github.io/GraphBed/201911/20191113211811.png" alt="https://gaoqisen.github.io/GraphBed/201911/20191113211811.png"></p>
<h3 id="七层详解" tabindex="-1"><a class="header-anchor" href="#七层详解" aria-hidden="true">#</a> 七层详解</h3>
<ul>
<li>应用层（针对特定应用的协议，参考模型的最底层）
<ul>
<li>应用层该协议在所需要传送的数据的前端附加一个首部信息。该首部信息里面会标明了内容和收件人。而当接受方接收到该数据后，会分析数据首部和数据正文，最终实现邮件传输。</li>
</ul>
</li>
<li>表示层（设备固有数据格式和网络标准数据格式的转换）
<ul>
<li>表示层的作用是把数据从某个计算机特定的数据格式转换为网络通用的标准数据格式，同时可以反转过来。其目的就是为了统一网络数据格式。即便是一段简单的文字也有着众多的编码格式，例如：UTF-8、UTF-16和EUC-JP等等。而表示层之间为了能够识别编码格式也会在数据前端附加首部信息。</li>
</ul>
</li>
<li>会话层（通信之间的管理）
<ul>
<li>会话层主要负责决定使用何种连接方式，例如在发送邮件的时候可以选择每一封发送完成后重新建立连接发送，也可以选择一个连接同时发送数个邮件，甚至可以同时建立数个连接发送。会话层也会在数据前端记录数据传送顺序的信息。（会话层负责决定建立连接和断开连接的十几，而传输层才是进行实际的建立和断开处理）。</li>
</ul>
</li>
<li>传输层（管理节点之间的数据传输）
<ul>
<li>传输层主要负责是建立连接和断开连接，并确保信息是否达到目标地址，它会在通信两端的计算机进行确认，如果数据没有达到，它会进行重发。为了确保可靠性，也会在数据前端加上首部信息以识别这一分层的数据。</li>
</ul>
</li>
<li>网络层（网络地址和路由的选择）
<ul>
<li>网络层中主要负责的是基于目的地址，在众多的数据链路中，将数据从发送端发送到接收端。网络层中会把目的地址的相关信息放在首部发送到下一层。</li>
</ul>
</li>
<li>数据链路层（互连设备之间传送和识别数据帧）
<ul>
<li>数据的传输实际还是通过物理的传输方式，而数据链路层实际就是在互连的设备之间进行数据处理。</li>
</ul>
</li>
<li>物理层（界定连接器和网线的规格）
<ul>
<li>物理层则是将0，1的数据转为电信号或者光信号给物理传输介质，而连接这些物理传输介质的设备之间是通过MAC地址（物理地址或硬件地址）传输。因此，物理层会把MAC地址作为首部信息放在数据前端，将其发送到网络。</li>
</ul>
</li>
</ul>
</div></template>


